{
	"events": [
		{
			"id": 1,
			"description": "Во время долгого путешествия по пустыне вы наткнулись на подземный источник воды. Вода выглядела кристально чистой, но имела странный привкус, который вы не могли объяснить. Вы стояли перед дилеммой: использовать эту воду для полива ваших иссохших растений или напоить себя, испытывая сильную жажду.",
			"options": {
				"0": {
					"text": "Использовать воду для полива растений",
					"result": "Растения начинают болеть и вянуть, урожай погибает. Оказалось, что вода содержала токсичные вещества.",
					"resourse_type": 1,
					"amount": 2,
					"duration": 20
				},
				"1": {
					"text": "Использовать воду для питья",
					"result": "Вы испытываете проблемы с желудком, ваша работоспособность снижается. Вода была заражена бактериями.",
					"resourse_type": 3,
					"amount": 3,
					"duration": 30
				},
				"2": {
					"text": "Использовать воду для бритья",
					"result": "Вы испытываете проблемы с желудком, ваша работоспособность снижается. Вода была заражена бактериями.",
					"resourse_type": 3,
					"amount": 3,
					"duration": 30
				}
			}
		},
		{
			"id": 2,
			"description": "Вы исследовали древний лес, когда наткнулись на странное растение, которое выделяло неизвестный газ. Газ казался безвредным, и вы даже почувствовали себя лучше. Тем не менее, стоило ли пересаживать растение в оранжерею или оставить его в лесу?",
			"options": {
				"0": {
					"text": "Пересадить растение в оранжерею",
					"result": "Растения в оранжерее начинают гибнуть от токсичного газа, который оказывается медленно отравляющим их.",
					"resourse_type": 1,
					"amount": 10,
					"duration": 5
				},
				"1": {
					"text": "Оставить растение на месте",
					"result": "Газ распространяется на окружающую территорию, вызывая массовую гибель фауны и ухудшение экологии.",
					"resourse_type": 0,
					"amount": 4,
					"duration": 60
				}
			}
		},
		{
			"id": 3,
			"description": "Во время своего пути вы наткнулись на заброшенную электростанцию, окруженную агрессивными дикими животными. Энергетический кризис на вашей базе заставил вас задуматься о ремонте станции, но риск стоил ли он того?",
			"options": {
				"0": {
					"text": "Починить электростанцию",
					"result": "Во время ремонта вас атакуют животные, и вы получаете тяжелые ранения, вынуждая вернуться с пустыми руками.",
					"resourse_type": 1,
					"amount": 40,
					"duration": 1
				},
				"1": {
					"text": "Оставить станцию без внимания",
					"result": "Без ремонта электростанция взрывается, нанося значительный ущерб окружающей среде и угрожая вашей безопасности.",
					"resourse_type": 2,
					"amount": 5,
					"duration": 10
				}
			}
		},
		{
			"id": 4,
			"description": "Глубоко в джунглях вы обнаружили редкое растение, которое, по вашему мнению, может очищать воду. Вы не уверены, справится ли оно с задачей, но жажда и необходимость в чистой воде заставляют вас принять решение.",
			"options": {
				"0": {
					"text": "Использовать растение для очистки воды",
					"result": "Растение не справляется с задачей, и вода становится еще более загрязненной, что вызывает массовое отравление.",
					"resourse_type": 3,
					"amount": 4,
					"duration": 15
				},
				"1": {
					"text": "Изучить растение для научных целей",
					"result": "Во время изучения растение выделяет яд, вызывая тяжелое отравление и парализуя научную работу на долгое время.",
					"resourse_type": 1,
					"amount": 1,
					"duration": 100
				}
			}
		},
		{
			"id": 5,
			"description": "Вы наткнулись на старую гидроэлектростанцию, покрытую ржавчиной и частично затопленную. Энергетический дефицит вынуждает вас рассмотреть возможность запуска станции, несмотря на ее плачевное состояние.",
			"options": {
				"0": {
					"text": "Запустить гидроэлектростанцию",
					"result": "Механизмы заклинивает, и станция выходит из строя, вызывая затопление территории и разрушение близлежащих построек.",
					"resourse_type": 3,
					"amount": 10,
					"duration": 10
				},
				"1": {
					"text": "Разобрать станцию на детали",
					"result": "Во время разборки вы получаете серьезные травмы от ржавого оборудования, что усугубляет дефицит рабочей силы и замедляет прогресс.",
					"resourse_type": 1,
					"amount": 1,
					"duration": 100
				}
			}
		}
	]
}
